[
    {
        "title": "Herbed leg of lamb ",
        "rating": 4.0,
        "review_nums": 13,
        "ingredients": [
            "1 x 2kg/4lb 8oz leg of lamb ",
            "small bunch oregano, leaves picked ",
            "1 tbsp rosemary leaves ",
            "4 garlic cloves, halved ",
            "1 lemon, zest and juice ",
            "1 orange, zest and juice ",
            "2 tbsp olive oil ",
            "2 tsp sea salt flakes "
        ],
        "method": [
            "Preheat the oven to 180C/160C Fan/Gas 4. ",
            "Sit the lamb in a large roasting tin, skin-side up, and use the tip of a sharp knife to make many incisions all over the skin. ",
            "Put the oregano, rosemary, garlic, lemon and orange zest, 2 tablespoons of lemon juice, 2 tablespoons orange juice, olive oil and salt in a bowl and blend using a stick blender (alternatively, use a small food processor). Spoon this over the lamb and rub in well. Leave at room temperature for 45 minutes. ",
            "Pour ½cm freshly boiled water into the bottom of the roasting tin and roast for 1 hour 40 minutes. Check after an hour to add more water if needed and cover with foil if the meat is beginning to catch. Just before the time is up, remove the lamb from the oven and check it is done to your liking, either using a probe and the temperatures listed in the tips below or piercing with a knife and taking a peek. ",
            "Remove the cooked lamb from the oven, cover loosely with foil, and rest for 15–30 minutes, checking every now and again, before transferring to a board to carve. "
        ]
    },
    {
        "title": "French-trimmed chicken breast with wild mushrooms",
        "rating": 4.0,
        "review_nums": 1,
        "ingredients": [
            "2 corn-fed free-range chicken breasts, French-trimmed (see below for method)",
            "salt and freshly ground black pepper",
            "50g/1¾oz butter",
            "1 tbsp olive oil",
            "2 shallots, finely chopped",
            "1 garlic clove, finely chopped",
            "50g/1¾oz trompettes de mort mushrooms, cleaned and trimmed",
            "50g/1¾oz chanterelle mushrooms, cleaned and trimmed",
            "50g/1¾oz girolles mushrooms, cleaned and trimmed",
            "75ml/3fl oz Madeira",
            "150ml/5fl oz reduced chicken stock",
            "75ml/3fl oz double cream",
            "2 tbsp finely chopped chives",
            "2 tbsp finely chopped chervil"
        ],
        "method": [
            "Preheat the oven to 180C/350F/Gas 4.",
            "To French-trim your own chicken, cut the legs from the bird and set them aside to use in another dish. Place a sharp knife onto the front end of the chicken and cut down either side of the wishbone. Discard the wishbone.",
            "Slice down either side of the breast bone and remove the chicken breasts, with the wings still attached. Trim the ends off the wings and discard.",
            "Run the knife around the end of each wing, push the flesh down to reveal some of the bone and scrape the flesh from the revealed bone. You now have a French-trimmed chicken breast.",
            "Season the chicken breasts with salt and freshly ground black pepper. Heat an ovenproof frying pan until hot, add half the butter then cook the chicken, skin side down, for 1-2 minutes or until the skin is golden-brown.",
            "Flip the chicken breasts over and cook for another minute then transfer to the oven and roast for 12-15 minutes or until the chicken is cooked through.",
            "Meanwhile, heat another frying pan, add the remaining butter, the shallots and garlic and cook gently for 1-2 minutes until just softened. Add the mushrooms, cook for one minute then add the Madeira, let it flambé then cook until reduced by half.",
            "Add the chicken stock and cook for another minute then add the cream. Season with salt and freshly ground black pepper then add the chives and chervil and stir them through the sauce.",
            "To serve, spoon the mushrooms onto a serving plate, carve the chicken into thick slices and place on the top."
        ]
    },
    {
        "title": "Instant noodles",
        "rating": 3.0,
        "review_nums": 4,
        "ingredients": [
            "1 medium free-range egg",
            "leftover meat and vegetables, such as roast chicken or pork, broccoli or shredded lettuce",
            "1 pack instant noodles, including flavouring sachet",
            "2 spring onions, chopped",
            "1 tbsp sesame seeds",
            "2 tbsp Chinese chilli oil",
            "2 tbsp shop-bought crispy fried onions"
        ],
        "method": [
            "Put the egg in a pan of boiling water and cook for 6 minutes, putting a heat-proof colander over the saucepan. Put the leftover meat and vegetables in the colander and cover with a lid to warm through. ",
            "Drain the egg and run under cold water to stop it cooking. Set aside.",
            "Rinse the pan and fill with 500ml/18fl oz boiling water. Add the noodles and cook according to packet instructions, returning the colander with the leftover meat and veg to the top of the pan. This should take about 2–3 minutes. ",
            "Meanwhile, peel the egg and slice in half.",
            "Tip the flavouring sachet into the pan of noodles and mix to dissolve in the water. Pour into a bowl, and add the meat, veg and egg. ",
            "To serve, top with the chopped spring onions, sesame seeds, Chinese chilli oil and crispy onions."
        ]
    },
    {
        "title": "Spring pea soup served with crab",
        "rating": null,
        "review_nums": null,
        "ingredients": [
            "30g/1oz butter",
            "2 tbsp olive oil",
            "1 onion, chopped",
            "400g/14oz fresh peas",
            "1 litre/1¾ pints chicken stock",
            "ice cubes",
            "20g/⅔oz black olives, diced",
            "1 Little Gem lettuce, leaves shredded",
            "10g basil, cut into strips, plus extra to garnish",
            "10g chives, chopped",
            "1 lemon, zest only",
            "1 lime, zest and juice",
            "160g/5½oz white crab meat",
            "salt and pepper",
            "olive oil, to taste",
            "100ml/3½fl oz double cream, whipped"
        ],
        "method": [
            "For the spring pea soup, heat the butter and oil in a large saucepan, when hot fry the onions until soft. Add the peas and cook for a further 3-4 minutes. ",
            "Bring the stock to the boil then pour it over the peas and onions. Return to the boil and cook for a further 3-4 minutes, or until the peas are tender.",
            "Drain the peas, reserving a little of the cooking stock. Blend the peas and cooked onions in a food processor with a little of the cooking stock.",
            "Pass through a sieve and set aside to cool in a bowl set over ice to retain the green colour.",
            "For the garnish, mix the olives, Little Gem lettuce, basil, chives, lemon zest, lime juice and zest with the crab meat, then season with salt and pepper. Add a little olive oil, to taste. Set aside.",
            "To serve, place the dressed crab in rings in the centre of shallow bowls. Pour the pea soup around and add a quenelle of double cream on top. Drizzle over a little extra olive oil and season the cream with a little black pepper."
        ]
    },
    {
        "title": "Sole Veronique",
        "rating": 4.0,
        "review_nums": 3,
        "ingredients": [
            "10g butter, plus extra for greasing",
            "4 x 200g/7oz skinless sole fillets ",
            "200ml/7fl oz good quality fresh fish stock",
            "100ml/3½ozfl oz dry vermouth",
            "1 bay leaf",
            "150ml/5fl oz double cream",
            "200g/7oz green grapes, cut in half and deseeded",
            "flaked sea salt and freshly ground white pepper"
        ],
        "method": [
            "Preheat the oven to 180C/350F/Gas 4.. ",
            "Lightly butter a shallow ovenproof dish. Fold the fish fillets in half and place in a single layer in the dish. Dot with pieces of butter.",
            "Pour the fish stock and vermouth around the fish. Cover the fish with a piece sheet of buttered aluminum foil. Bake for 20 minutes, or until just cooked. ",
            "Remove the fish from the oven and carefully pour the cooking liquid into a large frying pan. Cover the fish with the foil and put back in the oven to keep warm. ",
            "Bring the cooking liquor to the boil over a high heat. Boil until reduced to around 100ml/3½fl oz liquid. Pour the cream into the pan and return to a simmer. Stir in the grapes. Cook for a further minute, or until the grapes are hot. Season with salt and freshly ground black pepper.",
            "Remove the fish from the oven and gently pour over the sauce. Serve immediately."
        ]
    },
    {
        "title": "Moroccan couscous soup",
        "rating": 5.0,
        "review_nums": 1,
        "ingredients": [
            "50g/1¾oz caster sugar ",
            "few peppercorns ",
            "1 lemon, thinly sliced ",
            "1 tbsp vegetable oil",
            "1 red onion, sliced (or any onion, including spring onion)",
            "3 garlic cloves, sliced ",
            "1 tsp hot pepper paste ",
            "2 tbsp cumin seeds ",
            "1 sweet potato, peeled and diced ",
            "1 courgette, diced ",
            "3 fresh tomatoes, chopped (or tinned)",
            "400g tin chickpeas (or any tinned beans or pulses), drained and rinsed",
            "500ml/18fl oz chicken stock (or any stock)",
            "100g/3½oz  couscous ",
            "125g tin mackerel (or any tinned fish, such as sardines or pilchards), chopped",
            "2 tbsp chopped fresh coriander (or any soft herb)"
        ],
        "method": [
            "To make the confit lemon, place the sugar and 50ml/2fl oz water in a saucepan over a medium heat and simmer until the sugar has dissolved. Add the peppercorns and simmer for a few more minutes. Add the lemon, remove from the heat, cover and leave overnight. ",
            "To make the soup, heat the oil in a large saucepan and gently fry the onion, garlic, hot pepper paste and cumin seeds for 5–8 minutes. Add the sweet potato, courgette, tomato, chickpeas and stock. Simmer for 20 minutes. Stir in the couscous, mackerel and coriander and cook for another 5 minutes, until the couscous is cooked through. ",
            "Garnish the soup with the confit lemon and serve immediately. "
        ]
    },
    {
        "title": "Easy traybake cake",
        "rating": 4.0,
        "review_nums": 22,
        "ingredients": [
            "300g/10½oz unsalted butter, softened, plus extra for greasing",
            "300g/10½oz caster sugar",
            "6 free-range eggs",
            "300g/10½oz self-raising flour",
            "1 tbsp vanilla extract",
            "2 tbsp milk",
            "350g/12oz icing sugar",
            "175g/6oz unsalted butter, softened",
            "2 tsp vanilla extract",
            "2 tbsp milk",
            "crushed malted milk balls, sprinkles or other chocolates, to decorate"
        ],
        "method": [
            "Preheat the oven to 180C/160C Fan/Gas 4.",
            "Grease a 30x20cm/12x8in rectangular cake tin with butter. Line the tin with baking paper.",
            "In a large bowl, cream together the butter and sugar using an electric whisk until the mixture is pale and fluffy. Add the eggs one at a time, mixing until the egg is completely incorporated into the batter before adding the next. Add a tablespoon of flour if the mixture curdles.",
            "Stir in the vanilla extract and fold in the flour using a large metal spoon, stirring until no traces of flour are visible. Gently stir in the milk to loosen the mixture.",
            "Spoon into the prepared cake tin, spreading evenly with a spatula. Make a slight dip in the centre with the tip of the spatula.",
            "Bake for 35 minutes, or until the cake springs back when the centre is pressed gently with a finger. Remove from the oven and take the cake out of the tin after 10 minutes. Place on a wire rack to cool completely.",
            "To make the buttercream icing, sift half the icing sugar into a bowl with the softened butter and beat until light and fluffy. Beat in the remaining icing sugar, vanilla extract and milk.",
            "Place the cake upside down onto a cake board. Using a palette knife or spatula, spread the icing over the cake and down the sides. Decorate with the chocolate. "
        ]
    },
    {
        "title": "Victoria(ish) sponge dessert",
        "rating": null,
        "review_nums": null,
        "ingredients": [
            "½ vanilla pod, split",
            "90g/3¼oz caster sugar",
            "½ lemon, juice only",
            "3 free-range eggs",
            "5g dried yeast",
            "1 tsp runny honey",
            "125g/4½oz plain flour",
            "125g/4½oz caster sugar",
            "75g/2⅔oz salted butter, melted",
            "450g/1lb strawberries",
            "icing sugar, to taste",
            "100g/3½oz unsalted butter",
            "120g/4½oz icing sugar",
            "300g/10½ oz fresh strawberries",
            "small mint sprigs",
            "icing sugar, to dust"
        ],
        "method": [
            "Lightly grease and flour eight round doughnut ring savarin moulds and set aside.",
            "To make the vanilla syrup, put the vanilla pod, sugar and 100ml/3½fl oz water in a pan and heating gently until the sugar is dissolved. Add lemon juice to taste. Set aside and keep warm.",
            "To make the batter, mix together the eggs, yeast and honey in a bowl. Gradually stir in the flour and sugar to make a batter. Pour in the melted butter and whisk until smooth.",
            "Divide the mixture equally between the prepared savarin moulds, filling them to about 0.5cm from the top. Leave in a warm place, uncovered, to rise for an hour. ",
            "Preheat the oven to 180C/160C Fan/Gas 4. Bake for 12-15 minutes until golden, then allow to cool slightly before spooning over the warm vanilla syrup. Allow to cool completely, then turn out of the moulds.",
            "To make the strawberry sauce, blend the strawberries together with a little icing sugar using a hand-held stick blender or food processor. Pass the sauce through a sieve. Taste and add more icing sugar, if necessary. ",
            "To make the strawberry buttercream, beat together the butter and sugar in a bowl until smooth. Add a little of the strawberry sauce, to taste, then set aside.",
            "To assemble, pipe some buttercream onto the base of a dish, then top with a savarin sponge. Pour over some strawberry sauce, then add whipped cream and top with strawberries. Garnish with tiny mint sprigs and dust with icing sugar. Repeat for the remaining sponges and serve."
        ]
    },
    {
        "title": "Crusted salmon with samphire and preserved lemon sauce",
        "rating": 5.0,
        "review_nums": 5,
        "ingredients": [
            "large knob butter, softened, plus extra for greasing",
            "25g/1oz semolina",
            "1 tsp paprika",
            "4 x 125g/4½oz salmon fillets, skin removed",
            "small bunch flatleaf parsley, leaves and stalks separated ",
            "175g/6oz samphire",
            "salt and freshly ground black pepper",
            "½ lemon, cut into 4 wedges, to serve",
            "1 large or 2 small preserved lemons, quartered and pips removed",
            "½ lemon, juice only",
            "3 tbsp mayonnaise",
            "200g/7oz crème frâiche"
        ],
        "method": [
            "Preheat the oven to 200C/180C Fan/Gas 6 and grease a baking tray.",
            "To make the salmon, sprinkle the semolina and paprika over a large plate and season with salt and pepper. Spread the butter on top of each salmon fillet and press the fillets, buttered-side down, on to the semolina mixture to give an even crust.",
            "Lay the parsley stalks on the baking tray and sit the salmon fillets on top of the stalks. Bake in the oven for 15–18 minutes, until the salmon is just opaque and the top is crisp and golden. If liquid is beginning to seep out of the salmon, it is overcooked – it should be holding the juices.",
            "To make the sauce, place the parsley leaves in a food processor. Add the lemon and blitz until finely chopped. Add the lemon juice, mayonnaise and crème frâiche and season with salt and pepper – go easy on the salt as the lemons are preserved in brine. Process until combined. ",
            "When ready to serve, boil the samphire in a saucepan of salted water for 2 minutes, then drain. Place the lemon sauce in a saucepan and heat gently until just melted.",
            "Serve the salmon fillets with the samphire, sauce and lemon wedges alongside."
        ]
    },
    {
        "title": "Pongal",
        "rating": 4.5,
        "review_nums": 3,
        "ingredients": [
            "100g/3½oz basmati rice",
            "100g/3½oz lentils, such as red split lentils",
            "400ml tin coconut milk",
            "75g–100g/2½–3½oz jaggery, grated",
            "2 cardamom pods, crushed",
            "50g/1¾oz golden sultanas",
            "50g/1¾oz cashew nuts (toasted, optional)"
        ],
        "method": [
            "Wash the rice and lentils thoroughly in cold water a couple of times to remove the starch. ",
            "Bring 250ml/9fl oz water to the boil in a large saucepan. Once bubbling, add the rice and lentils and stir in the coconut milk. Bring to a boil then reduce the heat to a gentle simmer. Cook for 20–25 minutes, stirring frequently, until the rice and lentils are tender.",
            "Add the jaggery and cardamom pods and stir until the jaggery is dissolved. ",
            "Finally stir in the sultanas and cashew nuts. Continue to cook for a further few minutes, adding a splash of water if it starts to dry out. Simmer for a few minutes longer if it needs to reduce slightly. Remove the cardamom pods and serve."
        ]
    },
    {
        "title": "Matzo brei fritters",
        "rating": 4.5,
        "review_nums": 4,
        "ingredients": [
            "150g/5½oz matzo bread (or crackers), broken into small pieces",
            "1 large brown onion, grated",
            "1 garlic clove, grated",
            "2 free-range eggs, beaten",
            "30g/1oz parsley, roughly chopped ",
            "vegetable oil, for frying",
            "1 tsp flaky sea salt, plus extra to season",
            "freshly ground black pepper",
            "non-dairy horseradish cream (optional)",
            "fresh cucumber or radish (optional)",
            "pickled cucumber or onion (optional)",
            "fresh herbs, such as chives, chervil, parsley, mint (optional)"
        ],
        "method": [
            "Place the matzo bread or crackers in a large bowl, cover wth cold water and soak for 10 minutes. Transfer to a colander to strain off all the liquid. Pick up a handful at a time and squeeze out any excess liquid you can.",
            "Transfer the soft matzo to a mixing bowl. Mix in the onion, garlic, eggs and parsley as well as salt and plenty of freshly ground black pepper. Mix well to combine. ",
            "Heat a 2cm–3cm/¾in–1¼in thick layer of oil in a deep frying pan. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Use a tablespoon as a measure and drop a full spoon at a time into the hot oil. You should fry the fritters in batches of 6–7 at a time, so the oil doesn’t drop too much in temperature. Colour for 40–50 seconds on one side until golden-brown, then flip and repeat on the other side. Remove to a plate lined with kitchen paper and sprinkle with a little flaky sea salt. ",
            "Serve warm for best results with your choice of non-dairy horseradish cream, fresh cucumber or radish, pickled cucumber or onion and/or fresh herbs."
        ]
    },
    {
        "title": "Autumn pudding",
        "rating": 5.0,
        "review_nums": 5,
        "ingredients": [
            "400g/14oz English pears (such as Conference), peeled and cut into quarters",
            "300g/10oz cooking apples (such as Bramley), peeled and cut into quarters",
            "500g/17oz ripe plums, halved, stone removed",
            "450g/1lb fresh blackberries",
            "200g/7oz caster sugar",
            "15g/½oz butter",
            "sunflower oil, for greasing",
            "10 thick slices white bread, crusts removed"
        ],
        "method": [
            "Place the fruit, sugar and butter into a saucepan and cook on a medium heat for 15 minutes, or until softened. (Don’t stir too often as the fruit will become mushy.) ",
            "Remove the pan from the heat and pour the contents into a colander set over a large bowl. Leave to stand for 8-10 minutes, stirring once or twice, so as much juice as possible is released by the fruit. You should end up with around 600ml/20fl oz. ",
            "Pour the fruit juice back into the saucepan, bring to a simmer and cook for 10-15 minutes, or until the volume of the liquid has reduced by half. Remove the pan from the heat and set aside to cool for 20-30 minutes. ",
            "Lightly oil a 1.5 litre/2 pint pudding basin and line with clingfilm, leaving plenty overhanging the edge. Cut a slice of bread using a round cutter and dip it quickly into the fruit juice. Place in the base of the pudding basin. ",
            "Cut the other bread slices in half and dip one at a time into the juice. Arrange in slightly overlapping vertical pieces around the inside of the basin, making sure they are soaked in juice without being soggy. ",
            "Once all the sides of the basin are lined with bread, pour half of the remaining fruit juice over the drained fruit and stir very lightly until it looks plump and glossy. Spoon the mixture into the pudding basin. ",
            "Dip the remaining slices of bread in the fruit juice and place over the top of the pudding, trimming the bread where necessary to give a neat finish. Reserve any remaining fruit juice in a small bowl. ",
            "Place the pudding onto a dinner plate. Cover the top of the pudding with the cling film, place a plate on top (make sure it fits inside the basin) and weigh down with a couple of tins. Chill in the fridge overnight.",
            "When ready to serve, remove the weights and plate and open the clingfilm. Place a serving plate on top of the pudding and invert. Remove the basin and peel off the cling film. Brush any gaps where white bread is showing with the reserved fruit juice."
        ]
    },
    {
        "title": "Za’atar cod with relish ",
        "rating": 5.0,
        "review_nums": 4,
        "ingredients": [
            "2 heaped tbsp Za’atar ",
            "4 tbsp olive oil, plus extra for frying",
            "400g/14oz prime cod fillet or loin (or a different firm white fish), cut in to 4 pieces",
            "sea salt",
            "24 Kalamata olives, stones removed",
            "6 preserved lemons, halved and roughly chopped",
            "8 pickled chillies, thinly sliced",
            "1 small bunch of coriander, roughly chopped",
            "olive oil "
        ],
        "method": [
            "Mix the za’atar with the olive oil in a small bowl to create a paste. Smear this paste over the cod pieces, ensuring they are well coated. Season each piece of fish with a pinch of salt. Place in a non-reactive container and leave to marinade in the fridge for 30 minutes.",
            "For the relish, place all the ingredients in a bowl and mix well. Do not season the mixture with salt as it will already have a salty taste. ",
            "Heat a large frying pan over a medium heat, then drizzle in a generous amount of olive oil. ",
            "Fry the cod for about 8 minutes on one side and 3-4 minutes on the other side. The cod should be golden-brown with a nice spice crusting. ",
            "Serve the cod with a generous helping of the relish."
        ]
    },
    {
        "title": "Marinated tofu with fried rice",
        "rating": 4.0,
        "review_nums": 11,
        "ingredients": [
            "2 tbsp olive oil",
            "½ lime, zest and juice",
            "large pinch chilli flakes",
            "2 tbsp soy sauce",
            "2 tbsp honey or agave syrup",
            "2 tbsp vegetable oil",
            "150g/5½oz tofu, cut into pieces",
            "2 tbsp vegetable oil",
            "¼ onion, finely sliced",
            "1 garlic clove, crushed",
            "¼ red pepper, chopped",
            "handful spinach leaves",
            "150g/5½oz basmati rice, cooked according to packet instructions and drained"
        ],
        "method": [
            "For the marinated tofu, combine all the marinade ingredients, except the vegetable oil, in a bowl and mix well. Add the tofu, coat in the mixture and allow to marinate for 5-10 minutes, or longer if possible. ",
            "Heat a wok over a medium heat. Remove the tofu from the marinade, setting the marinade aside. Fry the tofu for 5-10 minutes until golden-brown all over. Strain the marinade to remove any small pieces of tofu.",
            "For the rice, heat the oil in a pan and fry the onions and garlic for 2-3 minutes until softened, then add the pepper and fry until the tofu for 2 minutes. Add the spinach, rice and reserved marinade and heat through for a further 3-4 minutes. ",
            "Serve the rice with the marinated tofu on top."
        ]
    },
    {
        "title": "Roast lamb with potatoes and fennel ",
        "rating": 5.0,
        "review_nums": 2,
        "ingredients": [
            "1 tbsp olive oil",
            "500g/1lb 2oz lamb neck or leg, cut into 1–2cm/½–¾in chunks ",
            "600g/1lb 5oz waxy potatoes, peeled and thinly sliced",
            "1 fennel, trimmed and thinly sliced",
            "2 shallots, thinly sliced",
            "100ml/3½fl oz chicken stock",
            "salt and freshly ground black pepper ",
            "75g/2¾oz pecorino, grated",
            "150g/5½oz chopped tomatoes, from a tin",
            "4 garlic cloves, crushed ",
            "30g/1oz fresh flatleaf parsley, chopped ",
            "2 tsp ground fennel seeds ",
            "3 tbsp olive oil",
            "salt and freshly ground black pepper ",
            "4 small globe artichokes, stalk, choke and hard outer leaves removed, green interior thinly sliced",
            "½ lemon, juice only",
            "3 tbsp olive oil",
            "1 garlic clove, crushed ",
            "splash white wine ",
            "50g/1¾oz broad beans ",
            "50g/1¾oz peas ",
            "2 tbsp finely chopped fresh mint ",
            "drizzle extra virgin olive oil",
            "salt and freshly ground black pepper "
        ],
        "method": [
            "To make the lamb, preheat the oven to 170C/150C Fan/Gas 3. ",
            "Heat the oil in a large frying pan and fry the lamb pieces. Season with salt and pepper. ",
            "To make the paste, place all the ingredients in a food processor and pulse until roughly combined. Season with salt and pepper.",
            "Place the potatoes, fennel and shallot in a large bowl and season with salt and pepper. Mix together with two-thirds of the paste. Stir the rest through the lamb pieces. ",
            "Layer half of the vegetables into a large roasting tin. Top with the lamb and cover with the remaining vegetables. Pour the chicken stock around the sides and cover with kitchen foil. Place in the oven for about 1½ hours or until the lamb is tender. If preferred, the top can be browned under a grill before serving. ",
            "To make the minty vegetables, place the artichoke in a bowl and cover with cold water. Add the lemon juice to prevent discolouration. Heat the oil in a large saucepan. Drain the artichokes and add to the pan, stirring well. Cook for a few minutes before adding the garlic and wine. Season with salt and pepper and cover. Cook gently for about 10 minutes or until the artichokes are tender. Blanch the broad beans for a few minutes, drain and add to the artichokes. Add the peas and cook for a few minutes. Add the mint and drizzle with the oil. ",
            "Serve the roasted lamb mixture with the minty green vegetables on the side. "
        ]
    },
    {
        "title": "Yorkshire pot with Christmas trimmings",
        "rating": null,
        "review_nums": null,
        "ingredients": [
            "butter, for greasing",
            "1 Yorkshire pot - 1 partridge, 1 pheasant, 1 chicken, 1 duck stuffed one inside each other (available ready-made from large supermarkets and some butchers)",
            "50g/2oz butter",
            "1 leek, cut in half lengthways, cleaned",
            "10 floury potatoes (such as King Edward or Maris Piper), peeled, halved",
            "50g/2oz lard or beef dripping",
            "salt",
            "1 onion, studded with 3 cloves",
            "500ml/18fl oz milk",
            "85-110g/3-4oz fresh white breadcrumbs",
            "50g/2oz butter",
            "50ml/2fl oz double cream",
            "freshly grated nutmeg",
            "pinch white pepper",
            "pinch cayenne pepper",
            "900g/2lb cranberries",
            "900g/2lb Bramley apples, peeled, chopped",
            "700ml/1 pint 5fl oz water",
            "½ tsp ground cloves",
            "½ tsp ground cinnamon",
            "450g/1lb caster sugar",
            "4 tbsp malt vinegar",
            "salt",
            "450g/1lb Brussels sprouts, trimmed",
            "1 tsp olive oil",
            "225g/8oz pancetta, cut into cubes"
        ],
        "method": [
            "Preheat the oven to 160C/320F/Gas 3.",
            "For the Yorkshire pot, butter a large piece of kitchen foil. Wrap the Yorkshire pot in the buttered foil to cover completely.",
            "Place the leek halves into a roasting tin and place the foil-wrapped Yorkshire pot onto the leeks. Transfer to the oven and roast for 2½ hours.",
            "Remove the Yorkshire pot from the oven and remove the foil.",
            "Increase the oven temperature to 200C/400F/Gas 6.",
            "Return the Yorkshire pot to the oven and cook for a further 10-15 minutes, or until golden-brown all over and completely cooked through. Check that the birds are cooked by placing a knife into the centre - the juices should run clear. If they are at all bloody, return to the oven and cook until the juices run clear. Remove from the oven and rest for 15 minutes before serving.",
            "For the roast potatoes, keep the oven temperature at 200C/400F/Gas 6.",
            "Place the potatoes into a saucepan and cover with water, and add a pinch of salt. Bring to the boil and cook for 3-4 minutes, then drain into a colander.",
            "Place a deep roasting tray onto the hob and add the lard or dripping. When the lard or dripping has melted, add the potatoes and fry in the roasting tray until the potatoes start to brown. Turn occasionally to ensure the potatoes brown on all sides.",
            "Sprinkle the potatoes with salt and place into the oven to roast for one hour, turning occasionally to ensure they cook evenly.",
            "For the bread sauce, place the clove-studded onion and milk into a heatproof bowl set over a pan of simmering water. Heat the milk until just below boiling point (the longer the milk takes to come to boiling point, the better the flavour of the sauce will be, so don't rush this process).",
            "Remove the onion and cloves from the milk, but keep the milk over the simmering water.",
            "Gradually add the breadcrumbs to the milk, whisking constantly, until the sauce becomes thick. ",
            "Season the sauce, to taste, with freshly grated nutmeg, salt, white pepper and cayenne pepper.",
            "Add the butter and cream and stir well until the butter has melted. Pour the sauce into a serving bowl and keep warm.",
            "For the cranberry and apple jelly, place the cranberries and apples into a saucepan with the water.",
            "Add the cloves and cinnamon and bring to the boil. Reduce the heat and simmer for 10-15 minutes, until the cranberries have split and the apple has become tender.",
            "Using a ladle, gradually strain the cranberry and apple mixture through a muslin-lined sieve into a large clean bowl. Don't press or force the berries as this will make the jelly cloudy.",
            "Add the sugar and vinegar to the liquid and mix well.",
            "Transfer the liquid to a clean pan and heat to just above boiling point - 104C on a sugar thermometer. Remove from the heat and leave the mixture to cool, then transfer to a sterilised jar.",
            "For the sprouts and pancetta, bring a saucepan of salted water to the boil and add the sprouts. Cook for 8-10 minutes, until tender, then drain into a colander.",
            "Heat a frying pan over a high heat until hot. Add the olive oil and pancetta cubes and fry for 5-7 minutes, until the pancetta is crisp and golden-brown. ",
            "Add the drained sprouts and stir together to warm through.",
            "To serve, carve the Yorkshire pot carefully to ensure that each slice contains a portion of each bird. Place a couple of slices onto each plate. Spoon the roast potatoes alongside, then add a spoonful of the sprouts and pancetta. Serve the white sauce and cranberry and apple jelly alongside."
        ]
    },
    {
        "title": "Keralan seafood pie",
        "rating": 4.5,
        "review_nums": 2,
        "ingredients": [
            "2 tbsp coconut oil or vegetable oil",
            "10 fresh curry leaves",
            "1 large onion, sliced",
            "2.5cm/1in fresh root ginger, cut into fine strips",
            "4 green chillies, split open lengthways",
            "500g/1lb 2oz mussels in the shell, cleaned",
            "½ tsp ground turmeric",
            "½ tbsp rice flour",
            "500ml/18fl oz extra thick coconut milk",
            "1 tsp salt",
            "250g/9oz peeled and deveined raw prawns",
            "200g/7oz undyed smoked haddock fillet, diced into 1 inch pieces",
            "200g/7oz cleaned squid tubes or cuttle fish, scored ",
            "375g/13oz all butter puff pastry – rolled 3mm/1/8in thick, 4 x 16cm diameter discs",
            "2 eggs, lightly beaten",
            "1 tbsp black onion seeds",
            "115g/4oz sprouted fenugreek seeds",
            "115g/4oz sprouted moong beans",
            "1 tomato, deseeded, cut into ½ cm/¼ in dice",
            "½ cucumber, deseeded, cut into ½ cm/¼ in dice",
            "1 green chilli (optional), finely chopped",
            "½ lemon, juice only",
            "½ tsp salt",
            "½ tsp sugar",
            "2-3 tbsp olive oil",
            "10 fresh curry leaves",
            "2 green chillies, split open lengthways"
        ],
        "method": [
            "For the pie, preheat the oven to 200C/400F/Gas 6.",
            "First make the sauce. Heat the oil in a large frying pan, add the curry leaves, onion, ginger and green chillies and cook, stirring, until the onion is soft. ",
            "Add the mussels and turmeric, followed by the rice flour. ",
            "Mix the rice flour in evenly, then add coconut milk and salt, and bring to a simmer. ",
            "Cook for 2-3 minutes, until the mussels open up and sauce begins to turn glossy. ",
            "Remove the mussels and take the meat out of the shell, discarding the shells. Set the mussels aside, and continue to cook the sauce until it thickens and becomes very thick.",
            "Remove the sauce from the heat, cool and mix the raw seafood and the mussel meat through the sauce.",
            "Divide the pie filling equally among four shallow cast-iron skillets, garnish with the green chillies and curry leaves and cover with the puff pastry disc.",
            "Brush the pies with egg, sprinkle with black onion seeds and bake in the oven for 15 minutes, or until the fish is cooked through and the pastry crisp and golden brown.",
            "For the salad, mix together all the ingredients for the salad.",
            "Serve the pie with the sprouted fenugreek and moong lentil salad alongside."
        ]
    },
    {
        "title": "Yorkshire curd tart",
        "rating": 5.0,
        "review_nums": 1,
        "ingredients": [
            "250g/9oz plain flour, plus extra for dusting",
            "100g/3½oz caster sugar",
            "100g/3½oz chilled butter, diced",
            "2 free-range egg yolks, beaten",
            "170g/6oz curd cheese (available from some large supermarkets)",
            "100g/3½oz caster sugar",
            "100g/3½oz butter, softened",
            "10g/¼oz plain flour",
            "50g/1¾oz raisins",
            "1 free-range egg, beaten",
            "1 lemon, zest only",
            "pinch nutmeg",
            "50g/1¾oz lemon curd "
        ],
        "method": [
            "For the sweet shortcrust pastry, grease and flour a 30cm/12in tart tin.",
            "Place the flour, caster sugar and chopped cold butter into a bowl or food processor. Gently rub the ingredients together with your fingertips or blend until the mixture resembles breadcrumbs.  ",
            "Add the beaten eggs and combine to form a light dough (add 2-3 tablespoons of water if needed).  ",
            "Form the dough into a ball and transfer to the fridge to chill for 30 minutes. ",
            "Preheat the oven to 180C/350F/Gas 4.",
            "On a lightly floured work surface, roll out the dough to 5mm/¼in thick. ",
            "Line the prepared tart tin with the pastry and trim any excess from the edges. Any unused pastry can be frozen for later use.",
            "Lay a piece of greaseproof paper over the pastry and fill with baking beans or dry pulses. Bake blind for 15-20 minutes at until dry and firm to touch.  ",
            "Remove the pastry case from the oven. Remove the baking beans and greaseproof paper. Set aside.",
            "For the filling, drain the liquid from the curd cheese by placing it in a sieve. Use the back of a spoon to squeeze out any excess moisture. Discard the liquid.",
            "In a bowl, beat the sugar and butter until smooth and pale.",
            "Add the flour, raisins, egg, curd cheese, lemon zest and nutmeg. Mix well.",
            "Spread the lemon curd over the pastry base, then fill with the curd cheese mix. Smooth the surface with a pallet knife or the back of a spoon.",
            "Bake for 35-40 minutes, or until the pastry is golden-brown and the filling set. ",
            "Allow the tart to cool in the tin for 20-25 minutes. ",
            "Remove from the tin and serve in slices."
        ]
    },
    {
        "title": "Vegan jerk jackfruit burger",
        "rating": 4.5,
        "review_nums": 19,
        "ingredients": [
            "400g tin jackfruit",
            "5 tbsp ready-made jerk barbecue marinade",
            "¼ red cabbage, shredded",
            "1 carrot, peeled and ribboned with a peeler",
            "2 spring onions, finely chopped",
            "5 tbsp vegan mayonnaise",
            "2 vegan burger buns or mini ciabattas, cut in half",
            "squeeze fresh lime",
            "1 tbsp chopped fresh coriander",
            "salt and freshly ground black pepper"
        ],
        "method": [
            "Preheat the oven to 200C/180C Fan/Gas 6. ",
            "Rinse and drain the jackfruit and put into a bowl. Use a fork to shred the pieces into strings. Add the jerk barbecue marinade and stir to coat. ",
            "Cover a baking tray with foil and brush with a little vegetable oil. Transfer the jackfruit on to the baking tray in a single layer and bake for 15–20 minutes, until the jackfruit has crisped up at the edges and is hot through.",
            "Meanwhile, put the onion, cabbage and carrot in a bowl and mix with enough vegan mayonnaise to make a coleslaw. Season with salt and pepper.",
            "Build your burgers with the slaw and barbecue jerk jackfruit and serve."
        ]
    },
    {
        "title": "Herb and tomato couscous with green beans",
        "rating": null,
        "review_nums": null,
        "ingredients": [
            "250g/9oz couscous",
            "150ml/¼ pint hot vegetable stock",
            "2 tbsp olive oil",
            "250g/9oz green beans, trimmed, blanched and chopped",
            "2 tomatoes, seeds removed and chopped",
            "1 lemon, juice only",
            "2 tbsp chopped fresh flatleaf parsley",
            "salt and freshly ground black pepper"
        ],
        "method": [
            "Place the couscous into a heatproof bowl, pour over the hot stock and olive oil and cover with cling film. Leave to stand for five minutes.",
            "Add the beans, tomatoes, lemon juice and parsley to the couscous. Season, to taste, with salt and freshly ground black pepper and stir well.",
            "To serve, place the couscous onto serving plates."
        ]
    },
    {
        "title": "Teriyaki chicken with leek and pepper stir-fry",
        "rating": 5.0,
        "review_nums": 9,
        "ingredients": [
            "1 tbsp sesame oil",
            "1 tbsp honey",
            "1 tbsp soy sauce",
            "100g/3½oz chicken thigh meat, scored with a sharp knife",
            "1 tbsp olive oil",
            "1 garlic clove, thinly sliced",
            "¼ leek, sliced into long thin strips",
            "¼ red pepper, sliced into long thin strips"
        ],
        "method": [
            "Preheat the oven to 200C/180C Fan/Gas 6.",
            "For the chicken, mix the sesame oil, honey and soy sauce together in a large bowl. Cover the chicken in the marinade and leave for 5 minutes.",
            "Heat a frying pan until hot. Remove the chicken from the marinade, reserve the marinade mixture. Fry the chicken for 2-3 minutes on each side. Transfer the chicken to the oven and roast for 5 minutes, or until cooked through. ",
            "To make the stir-fry, heat the oil in a small frying pan. Add the garlic, leeks and pepper and cook until soft. Pour in the marinade mixture and bring to a simmer, continue to cook until the mixture is thick. ",
            "Spoon the stir fried vegetables into the centre of a plate, put the chicken on top and serve. "
        ]
    },
    {
        "title": "Pizza with pata negra ham",
        "rating": 5.0,
        "review_nums": 1,
        "ingredients": [
            "500g/1lb 2oz strong white flour, plus extra for dusting",
            "½ tsp salt",
            "7g sachet dried fast action yeast",
            "1 tbsp olive oil",
            "2 tbsp olive oil",
            "2 banana shallots, finely chopped",
            "2 garlic cloves, finely chopped",
            "2 x 400g/14oz cans chopped tomatoes",
            "2 tsp sugar",
            "1 bunch fresh basil leaves, chopped",
            "2 large buffalo mozzarella, thickly sliced",
            "200g/7oz piquillo peppers, thickly sliced",
            "16 slices pata negra ham ",
            "2 handfuls rocket leaves",
            "small handful basil leaves",
            "2 tbsp olive oil",
            "1 tbsp malden salt",
            "200g/7oz padron peppers"
        ],
        "method": [
            "For the pizza dough, place the flour, salt and yeast into a large bowl, add 300ml/10½fl oz warm water and the olive oil and mix together to form a dough.",
            "Knead the dough for at least five minutes, until elastic. ",
            "Cover the dough with cling film, then set aside and allow to prove for one hour.",
            "Divide the dough into four equal pieces and roll each piece into a ball, then roll out onto a floured work surface until about 5mm/¼in thick.",
            "Place onto a floured baking tray and set aside to prove for 30 minutes.",
            "Meanwhile, for the topping, heat a frying pan until hot, and then add the oil, shallots and garlic and fry for 3-4 minutes. Add the tomatoes, sugar and the chopped basil and bring to the boil. ",
            "Reduce the heat and simmer for 20 minutes, or until the sauce has thickened. Season to taste with salt and freshly ground black pepper and set aside to cool.",
            "Preheat the oven to 220C/425F/Gas 7. ",
            "Place a heavy baking tray or a pizza stone into the oven to preheat.",
            "Spoon the cooled tomato sauce thinly over the pizza.",
            "Scatter the mozzarella and piquillo peppers over the top.",
            "Carefully transfer the pizza into the oven, pushing the pizzs from the floured tray onto the hot tray or pizza stone. ",
            "Cook for 8-10 minutes, or until the base is crisp and the topping is cooked through.",
            "Remove the pizza from the oven and arrange the pata negra on top. Scatter over the rocket and basil leaves. ",
            "For the salad, heat a frying pan until hot, add one tablespoon of the olive oil, the malden salt and padron peppers and fry for 2-3 minutes until golden-brown. Remove the peppers from the pan and set aside to drain on kitchen paper.",
            "Serve the pizza with the peppers alongside."
        ]
    },
    {
        "title": "White chocolate cheesecake",
        "rating": 4.5,
        "review_nums": 70,
        "ingredients": [
            "200g/7oz cooking white chocolate, roughly chopped",
            "300g/10½oz full-fat cream cheese, at room temperature, liquid drained",
            "300ml/10fl oz double cream ",
            "1 tsp lemon juice",
            "1 tsp vanilla extract ",
            "175g/6oz gingernut biscuits ",
            "50g/1¾oz unsalted butter, softened "
        ],
        "method": [
            "To make the filling, gently melt the white chocolate in a heatproof bowl sat over a saucepan filled with 4cm/2in just boiled water on a low heat. Make sure the base of the bowl doesn’t touch the water. Once there are only a few small lumps of unmelted chocolate left, give it another stir then remove the bowl and sit it somewhere for about 10 minutes, until the chocolate remains liquid but is cooled to room temperature. ",
            "To make the base, break the biscuits into a food processor and blend until you have almost all crumbs. Add the butter and process again until the mixture starts to clump and cleave to the blade. If doing this by hand, put the biscuits into a bag, crush to crumbs, then melt the butter and stir into the biscuit crumbs until well mixed.",
            "Press the biscuit mixture into a 20cm/8in springform cake tin, letting some come a little way up the sides. The back of a spoon is the easiest tool for the job here. Stash the tin in the fridge while you get on with the cheesecake filling. ",
            "Beat the cream cheese with a wooden spoon in a large bowl, until it is soft. Gently fold in the slightly cooled, melted white chocolate. ",
            "Softly whip the cream so it is thickened but the peaks don’t hold their shape, then fold it into the white chocolate mixture in two batches. Add the lemon juice and vanilla extract and fold these in, then pour and scrape the pale, almost-moussy mixture into the biscuit-lined tin. Smooth the top, cover the tin with cling film and refrigerate overnight before serving. ",
            "When ready to serve, remove from the fridge for 10 minutes before unclipping from the tin and cutting it into slices. "
        ]
    },
    {
        "title": "Pork loin cooked in milk",
        "rating": null,
        "review_nums": null,
        "ingredients": [
            "4 tbsp olive oil",
            "3–4 kg/6lb 8oz–8lb 13oz whole pork loin on the bone ",
            "2 onions, sliced",
            "2 small or 1 large garlic bulb, cut horizontally through the middle",
            "100g/3½oz butter",
            "3–4 cloves ",
            "pinch freshly grated nutmeg",
            "2 cinnamon sticks",
            "10 black or mixed peppercorns",
            "4–5 bay leaves",
            "2 litres/3½ pints milk",
            "2 lemons, thick strips of zest and juice only",
            "salt and freshly ground black pepper",
            "1 bunch Swiss chard, stems removed and roughly chopped, leaves shredded",
            "2 tbsp olive oil"
        ],
        "method": [
            "Preheat the oven to 150C/130C Fan/Gas 2.",
            "For the pork, heat the olive oil in a large ovenproof dish over a high heat. Once hot, season the pork with salt and pepper and fry until browned on both sides. Add the onion, garlic and butter and fry for 2–3 minutes. Stir in the spices and pour in the milk. Add the lemon peel and juice. Transfer to the oven and cook for 1½–2 hours. ",
            "Once the pork is cooked, strain the cooking liquor and simmer over a medium heat until the volume of liquid is reduced to a sauce consistency. It will have curdled, but that’s how it’s meant to be. ",
            "To serve, bring a large saucepan of salted water to the boil. Cook the Swiss chard for 2 minutes, then drain well and set aside.",
            "Heat a frying pan and add the oil. Once hot, add the blanched Swiss chard and cook for a few minutes until tender.",
            "Slice the pork into portions and pour the sauce over the top. Serve the Swiss chard on the side."
        ]
    },
    {
        "title": "Corn ribs with mojito crema and cumin burnt lime",
        "rating": 3.5,
        "review_nums": 5,
        "ingredients": [
            "4 corn on the cobs",
            "100g/3½oz butter, very soft ",
            "4 garlic cloves, crushed",
            "4 tsp paprika",
            "2 tsp chilli powder",
            "small bunch fresh flatleaf parsley, finely chopped",
            "1 red chilli, finely chopped",
            "bunch fresh mint leaves, finely chopped",
            "1 lime, zest and juice ",
            "1 tbsp white rum",
            "4 tbsp crème fraîche",
            "4 tbsp soured cream",
            "salt and freshly ground black pepper",
            "2 limes",
            "½ tsp ground cumin"
        ],
        "method": [
            "Preheat the oven to 220C/200C Fan/Gas 7. Bring a large saucepan of water to the boil.",
            "Boil the corn cobs for 3 minutes, then transfer to a chopping board using kitchen tongs.",
            "Stand each corn cob vertically on the board and, using a very sharp knife, cut in half, straight down through the core. Place each half core-side down on the chopping board and cut through lengthways to create the ‘ribs’. Repeat with the other cobs.",
            "Mix the butter with the garlic, paprika, chilli powder and two-thirds of the chopped parsley. Coat the corn ribs in the butter, then place on two baking trays. Bake for 20 minutes, until the ribs are curled and lightly coloured.",
            "Meanwhile, to make the mojito crema, blitz the mint, lime zest and juice and rum together using a stick blender, until smooth. Stir in the crème fraîche and soured cream, season to taste and set aside. ",
            "To make the cumin burnt limes, slice the limes in half, rub a little cumin onto each half and place cut-side down in a frying pan over a high heat. Cook for about 3 minutes, until charred and juicy. ",
            "Stack four corn ribs on each plate, sprinkle over the chopped chilli and reserved parsley. Serve with a burnt lime half and the mojito crema."
        ]
    },
    {
        "title": "Honey-roasted fig and red onion crostini",
        "rating": null,
        "review_nums": null,
        "ingredients": [
            "1 tbsp olive oil",
            "¼ red onion, finely sliced",
            "1 garlic clove, chopped",
            "1 tsp soft brown sugar",
            "2 tsp balsamic vinegar",
            "1 fig, halved",
            "1 tbsp clear honey",
            "2 slices baguette, toasted"
        ],
        "method": [
            "Preheat the oven to 200C/400F/Gas 6.",
            "Heat the olive oil in a pan, add the red onion and fry over a gentle heat for five minutes until softened.",
            "Add the garlic and sugar and cook for 1-2 minutes. Add the balsamic vinegar and cook for three minutes.",
            "Place the halved fig onto a baking sheet and drizzle with honey. Roast for five minutes in the oven.",
            "To serve, spread the caramelised onions onto the toasted baguette slices and top with the honey-roasted figs."
        ]
    },
    {
        "title": "Buttermilk crumpets with black pudding, poached egg, and bacon and chive hollandaise",
        "rating": null,
        "review_nums": null,
        "ingredients": [
            "225g/8oz plain flour",
            "1 x 7g sachet dried fast-action yeast ",
            "150ml/5floz buttermilk",
            "175ml/6fl oz warm water",
            "1 tsp salt",
            "1-2 tbsp light olive oil",
            "125g/4½oz butter, melted",
            "2 tsp lemon juice",
            "2 tsp white wine vinegar",
            "2 free-range egg yolks ",
            "salt and freshly ground black pepper",
            "4 rashers streaky bacon",
            "2-3 tbsp chives, finely chopped",
            "2 tbsp white wine vinegar",
            "4 free-range eggs",
            "1 tbsp light olive oil",
            "12 slices black pudding"
        ],
        "method": [
            "For the crumpets, stir together the flour and salt in a large mixing bowl, and whisk in the yeast, the buttermilk and water.",
            "Cover the bowl tightly with cling film and leave to prove in a warm place for one hour or until at least doubled in volume. Preheat the oven to 170C/325F/Gas 3. ",
            "Heat a frying pan until medium hot then add a little of the oil. Lightly oil the inside of four 8cm/3¼in metal rings then place them in the pan. ",
            "Pour or ladle batter into each ring to fill about half way. Cook the crumpets until the top has completely set, then remove the metal rings, flip the crumpets over and cook for one more minute.",
            "Transfer the crumpets to a baking tray and bake in the oven for 10 minutes.",
            "Serve immediately or cool on a wire rack until ready to grill. ",
            "For the hollandaise, place the butter in a saucepan and bring to a very gentle simmer.",
            "Place the lemon juice and vinegar into a separate small pan and heat until just boiling.",
            "Place the egg yolks into a food processor with a pinch of salt and switch on. With the motor running, add the hot lemon and vinegar then very slowly add the melted butter until it is all incorporated. Transfer the sauce to a small bowl, season with a little salt and freshly ground black pepper and keep warm.",
            "Meanwhile, heat a frying pan until hot, add the bacon and cook on either side for 2-3 minutes until cooked through and crisp. Drain on kitchen paper, then roughly chop and add to the hollandaise. Stir in the chives to combine, then check the seasoning once more.",
            "For the poached eggs, bring a pan of salted water to the boil and add the vinegar. Whisk the water to create a whirlpool and once settled, carefully crack an egg into the water. Simmer for 2-3 minutes then remove the poached egg carefully with a slotted spoon and place on a plate to drain. Repeat the process with the remaining eggs.",
            "Heat a frying pan until hot, add the olive oil and cook the black pudding until crisp on each side. Remove with a slotted spoon and set aside to drain on kitchen paper.",
            "To serve, place the crumpets onto serving plates and top with a poached egg. Pile the black pudding alongside then finish with a drizzle of hollandaise."
        ]
    },
    {
        "title": "Banana bran muffins",
        "rating": 4.5,
        "review_nums": 8,
        "ingredients": [
            "115g/4¼ oz butter ",
            "100g/3½ oz brown sugar ",
            "3 bananas, mashed ",
            "115ml/4¼ fl oz milk ",
            "1 tsp vanilla extract ",
            "2 free-range eggs ",
            "175g/6¼ oz wholemeal flour ",
            "100g/3½ oz wheat bran ",
            "1 tsp baking powder ",
            "1 tsp baking soda ",
            "¼ tsp salt ",
            "handful chopped walnuts, to taste"
        ],
        "method": [
            "Preheat the oven to 190C/375F/Gas 5 and grease a muffin tin or line with muffin cases. ",
            "In a large mixing bowl, cream the butter and brown sugar until fluffy. Add the bananas, milk, vanilla and eggs and mix well. ",
            "Combine the flour, bran, baking powder, baking soda and salt and blend into the banana mixture. Stir in as many walnuts as you desire and pour the mixture into the muffin tray or cases. ",
            "Bake for 20-25 minutes or until a toothpick inserted into the centre of the muffin comes out clean. Cool in the tray for five minutes then place on a wire rack to cool completely."
        ]
    },
    {
        "title": "Prawn croquetas",
        "rating": 4.5,
        "review_nums": 14,
        "ingredients": [
            "85g/3oz butter",
            "115g/4oz plain flour",
            "350ml/12fl oz full-fat milk",
            "150ml/5fl oz double cream",
            "250g/9oz small North Atlantic prawns,  cooked and peeled (defrosted and drained if frozen)",
            "salt and freshly ground black pepper",
            "700ml/1¼ pints vegetable or sunflower oil",
            "75g/2¾oz plain flour",
            "2 free-range eggs, beaten",
            "175g/6oz panko breadcrumbs"
        ],
        "method": [
            "To make the filling, melt the butter in a saucepan over a medium heat. Add the flour and cook for a minute or so. Gradually add the milk and cream, whisking well all the time to ensure there are no lumps. Increase the heat slightly and bring the sauce to the boil. Turn the heat down and cook the sauce gently for 5 minutes, stirring often, by which time it should have thickened.",
            "Stir in the prawns and season with 1 teaspoon of salt and plenty of black pepper. Spread this mixture out on a lined baking tray, cover the surface with a sheet of baking paper and leave to cool. Place the mixture in the fridge for 2 hours to firm up.",
            "Heat the oil in a deep saucepan to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Put the flour, eggs and breadcrumbs in three separate wide bowls.",
            "Using two dessertspoons, scoop out eight portions of the prawn mixture, each weighing about 20g/¾oz, and drop them into the flour. Mould them with your hands into rough cork shapes and dip each into the beaten egg. Finally, coat each thoroughly in the breadcrumbs. Repeat with the rest of the mixture.",
            "Lower eight croquetas at a time into the hot oil and fry for 2 minutes until crisp and lightly golden. Drain on kitchen paper and keep warm while you cook the rest. Serve immediately.  "
        ]
    },
    {
        "title": "Smoked salmon and watercress pâté",
        "rating": 4.5,
        "review_nums": 9,
        "ingredients": [
            "100g/3½oz soft butter, plus extra for greasing and the salmon",
            "small bunch dill, chopped, plus 4 small sprigs ",
            "150g/5½oz salmon fillet, skinned ",
            "350g/12oz smoked salmon cocktail slices",
            "2 tsp hot horseradish sauce",
            "180g/6¼oz full-fat cream cheese",
            "1 tbsp lemon juice ",
            "small bunch watercress, roughly chopped, plus extra to serve  ",
            "salt and freshly ground black pepper",
            "brown bread, toasted",
            "lemon wedges"
        ],
        "method": [
            "Preheat the oven to 180C/160C Fan/Gas 4. Grease the inside of a 450g/1lb loaf tin with butter. Line with baking paper, leaving an overhang – this will help you remove the pâté. Lay 3 sprigs of dill in the centre of the base of the tin.",
            "Lay a piece of foil on the worktop and spread with a knob of butter. Sit the salmon fillet on top, spread with a little more butter and season with salt and pepper. Sit the remaining sprig of dill on top, fold into a parcel and place on a baking sheet. Bake for 15 minutes or until just cooked. Leave to cool completely in the foil. ",
            "Line the base and sides of the tin with strips of the smoked salmon, leaving an overhang the whole way round the tin. You should have about 60–70g/2¼–2½oz of the salmon left.",
            "Put the remaining smoked salmon into a food processor or blender with the cold salmon fillet, horseradish, cream cheese, soft butter, lemon juice, a little salt and plenty of black pepper. Blend until smooth. Spoon 3 tablespoons of the pâté into a bowl and add the chopped watercress and dill and mix well. Set aside.",
            "Spread half of the pâté from the blender into the base of the tin. Spread the watercress mix over the top, using the back of a spoon to push to the edges and corners in an even layer. Spread the remaining pâté on top and level the mixture. Flip the overhanging smoked salmon slices over the top and press down firmly. Chill in the fridge for at least 5 hours or until firm. ",
            "Serve in thick slices with the brown toast, lemon wedges and extra sprigs of watercress on the side."
        ]
    },
    {
        "title": "Salted caramel and chocolate mousse ",
        "rating": 4.0,
        "review_nums": 14,
        "ingredients": [
            "100g/3½oz granulated sugar",
            "2 tbsp golden syrup",
            "30g/1oz unsalted butter",
            "80ml/2¾fl oz double cream",
            "½ tsp sea salt",
            "330g/11½oz dark chocolate (55-70% cocoa solids), chopped into small pieces",
            "30g/1oz unsalted butter",
            "8 free-range eggs, separated",
            "1 tbsp caster sugar",
            "whipped double cream, to serve"
        ],
        "method": [
            "For the salted caramel sauce, place the sugar, two tablespoons water and golden syrup in a saucepan and bring to a boil, stirring occasionally. When the sugar has turned a rich amber colour, remove from the heat and stir in the butter, cream and salt. Pour into a bowl, cover the surface with clingfilm and cool completely.",
            "For the mousse, melt the chocolate and butter in a bowl set over a pan of simmering water - ensuring that the bottom of the bowl does not touch the water. Set aside to cool a little. Then whisk the egg yolks into the cooled chocolate mixture.",
            "In a separate bowl, whisk the egg whites to a light foam then add the caster sugar and whisk again until soft peaks form when the whisk is removed. Stir a third of the egg whites into the chocolate mixture. Then carefully fold in the remaining egg whites until well incorporated.",
            "Pour a tablespoon of salted caramel sauce into the bottom of each serving glass. Top with one-third of the mousse mixture. Drizzle over enough sauce to cover the mousse. Repeat this layering with mousse and caramel, finishing with a final layer of mousse. Refrigerate for an hour before serving. If chilled for longer, remove 30 minutes before serving. Finish with a dollop of whipped cream."
        ]
    },
    {
        "title": "Potato and smoked salmon fritters with soft boiled egg and bacon",
        "rating": 4.5,
        "review_nums": 2,
        "ingredients": [
            "1 large potato, peeled and grated",
            "3 slices of long sliced smoked salmon, cut into strips",
            "1 tbsp fresh dill, chopped",
            "2 free-range eggs, beaten",
            "2 tbsp plain flour",
            "salt and freshly ground black pepper",
            "vegetable oil, for frying",
            "2 free-range eggs",
            "4 slices streaky bacon",
            "50ml/2fl oz maple syrup",
            "½ tsp sweet smoked paprika, plus extra",
            "100g/3½oz spinach, wilted"
        ],
        "method": [
            "To make the fritters, mix all the ingredients together in a bowl and season with salt and pepper. Form into two equal-sized rounds and set aside until ready to cook.",
            "Bring a pan of water to the boil, then cook the eggs for 6 minutes until soft-boiled. Remove the boiled eggs from the water and run under cold water for a minute or two. When cool enough to handle, peel the eggs and set aside.",
            "To cook the fritters, heat 2 tbsp oil in a frying pan over a medium heat.  Fry the fritters for 2 minutes on each side or until golden-brown and crisp.",
            "Meanwhile, fry the bacon until crispy. In a small pan, boil the maple syrup together with the paprika.",
            "Serve the fritters alongside the wilted spinach and soft-boiled egg. Top with the crispy bacon and spoon some maple syrup over the top and a pinch more paprika to finish."
        ]
    },
    {
        "title": "Simple chicken curry",
        "rating": 5.0,
        "review_nums": 16,
        "ingredients": [
            "4 large skinless chicken breasts, cut into chunks",
            "3 tbsp vegetable oil",
            "1 tsp yellow or brown mustard seeds ",
            "1 large onion, sliced",
            "3 garlic cloves, finely sliced",
            "1x400ml can coconut milk",
            "salt",
            "1 tsp paprika",
            "½ tsp ground turmeric",
            "1½ tbsp ground coriander",
            "1 tsp ground cumin",
            "1 tsp cayenne pepper",
            "1 tbsp lemon juice",
            "½ tsp salt",
            "75ml/2¾fl oz water"
        ],
        "method": [
            "Mix together all the marinade ingredients to give you a loose, smooth paste. Add the chicken pieces and coat them in the paste. They are best left to marinate for around 30 minutes to 1 hour, but if you're in a hurry a few minutes will do. ",
            "Heat the oil in a deep frying pan and add the mustard seeds. When they start to pop and jump about in the pan, add the onion and garlic. Cook until they're golden brown before adding the chicken and any extra paste from the marinade. Fry over a gentle heat for about 8 minutes before adding the coconut milk. Increase the heat slightly and bring to a simmer. Cook for a further 10-12 minutes until the sauce has thickened slightly before seasoning with salt if necessary and serving with rice or naan bread."
        ]
    },
    {
        "title": "Singapore-style noodles",
        "rating": 4.5,
        "review_nums": 18,
        "ingredients": [
            "2 tbsp groundnut oil",
            "1 tbsp grated fresh root ginger",
            "1 red chilli, de-seeded, finely chopped",
            "5 fresh shiitake mushrooms, sliced",
            "2 tsp ground turmeric ",
            "100g/3½oz smoked bacon, finely chopped",
            "1 red pepper, de-seeded and sliced",
            "1 handful julienned carrot strips",
            "1 handful beansprouts",
            "100g/3½oz leftover chicken, shredded",
            "250g/9oz dried vermicelli rice noodles, pre-soaked in hot water for 10 minutes and drained",
            "1 tsp crushed dried chillies",
            "2 tbsp light soy sauce",
            "2 tbsp oyster sauce",
            "1 tbsp clear rice vinegar or cider vinegar",
            "1 free-range egg, beaten",
            "dash toasted sesame oil",
            "2 spring onions, sliced lengthways"
        ],
        "method": [
            "Heat a wok until smoking and add the groundnut oil, then stir fry the ginger, chilli, mushrooms and turmeric for a few seconds.",
            "Add the bacon and cook for 15-20 seconds, then add the red pepper, carrots, beansprouts and cooked chicken. Stir-fry for one minute.",
            "Add the noodles to the wok and toss for 1-2 minutes, then season with the chillies, soy sauce, oyster sauce and vinegar. Stir well to combine. ",
            "Pour the beaten egg into the wok and stir gently for one minute, or until the egg is cooked through. Season with a dash of sesame oil, then pile the stir-fry onto a serving plate and garnish with the sliced spring onions."
        ]
    },
    {
        "title": "Paprika Quorn ragù with cheese dumplings",
        "rating": 5.0,
        "review_nums": 1,
        "ingredients": [
            "2 tbsp olive oil",
            "1 onion, chopped",
            "2 garlic cloves, chopped",
            "1 tsp smoked paprika",
            "150g/5oz Quorn pieces",
            "150ml/5fl oz white wine",
            "150ml/5fl oz double cream",
            "85g/3oz cherry tomatoes, halved ",
            "150g/5oz self-raising flour",
            "1 tsp baking powder",
            "1 tbsp olive oil",
            "75ml/2½fl oz milk",
            "85g/3oz Double Gloucester cheese, grated"
        ],
        "method": [
            "Preheat the oven to 180C/360F/Gas 4.",
            "For the ragu, heat the oil in a pan and gently fry the onion and garlic for 4-5 minutes, until soft. ",
            "Add the smoked paprika and Quorn pieces and stir well. Continue to fry for 5-7 minutes, then add the wine and bring to the boil.",
            "Add the cream and tomato halves and simmer for 3-4 minutes.",
            "For the dumplings, place the flour, baking powder, oil and enough milk to bind the mix into a food processor and pulse until just coming together as a dough. ",
            "Add the cheese and pulse again to just combine.",
            "Roll pieces of the mix into balls about the size of a tangerine, then place them onto a baking sheet. Press the dough balls down slightly, then transfer to the oven to bake for 8-10 minutes, or until golden-brown.",
            "To serve, place the ragu into a serving bowl with the dumplings alongside."
        ]
    },
    {
        "title": "Kids' spaghetti and meatballs",
        "rating": 5.0,
        "review_nums": 6,
        "ingredients": [
            "4 cream crackers",
            "500g/1lb 2oz lean beef mince ",
            "1 tsp dried mixed herbs",
            "1 free-range egg",
            "1 tbsp olive oil",
            "1 tbsp olive oil",
            "2 onions, finely chopped",
            "1 small carrot, grated",
            "1 garlic clove, crushed",
            "1 x 400g tin chopped tomatoes",
            "2 tbsp tomato purée",
            "500g/1lb 2oz spaghetti, cooked according to packet instructions",
            "salt and pepper"
        ],
        "method": [
            "Put the cream crackers in a plastic bag. Wrap the bag in a tea towel and bash with a rolling pin until crushed.",
            "Put the mince in a large bowl, add the mixed herbs and crushed cream crackers. Tap the egg gently on the side of the bowl and crack the egg into the bowl. Mix the mince mixture together with your hands, wet hands are best for this job. Really get squished in so all the ingredients are mixed together. ",
            "To shape the meatballs take a spoonful of the mince mixture and place in the palm of your hands. Cup your other hand over the mince and roll to make perfectly round meatballs. Make 16 meatballs, put the meatballs on a large plate and chill in the fridge for 20 minutes.  ",
            "Wash your hands before the next step, it is very important to always wash your hands after handling raw meat and fish.",
            "To make the tomato sauce, heat a large pan and add the oil. Add the onion, carrots and garlic and fry for 6 minutes, or until soft but not browned. Add the tinned tomatoes and tomato purée. Season with salt and pepper and allow to simmer for 15 minutes on a low heat.",
            "Heat a tablespoon of oil in another shallow pan, add the meatballs and cook over a medium heat for a few minutes until browned on the outside. To keep your meatballs round when frying, hold the handle of the pan and shake the pan in a round action so that the meatballs never have a chance to settle and flatten and remain round. ",
            "When the meatballs are evenly browned and cooked through, add them to the tomato sauce and simmer for a further 5 minutes. Serve the meatball sauce with spaghetti."
        ]
    },
    {
        "title": "Stir-fry duck noodles",
        "rating": 5.0,
        "review_nums": 1,
        "ingredients": [
            "half roast duck (eg Chinese barbecued roast duck)",
            "3 spring onions,  finely chopped",
            "2 celery stalks,  finely chopped",
            "1 small red chilli,  finely chopped",
            "2 tbsp vegetable oil",
            "1 slice fresh ginger",
            "1 garlic clove, peeled and smashed",
            "400g/14oz fresh oiled egg noodles",
            "200g/7oz bean sprouts, rinsed",
            "1 tbsp Chinese rice wine or dry sherry",
            "1 tbsp hoisin sauce",
            "2 tbsp oyster sauce",
            "2 tbsp soy sauce",
            "sugar, to taste"
        ],
        "method": [
            "Remove the flesh from the duck and finely slice it, discarding the bones. ",
            "Heat a wok (or frying pan), add the oil and heat.",
            "Add the ginger and garlic and cook until golden to flavour the oil, then remove and discard. Add the celery, chilli and half the spring onions and stir-fry for 2 minutes. Add the duck and stir-fry for 1 more minute.",
            "Put the noodles in a heatproof bowl, cover with boiling water, then drain immediately. Add to the wok and toss well over a high heat.",
            "Add the bean sprouts, toss, then add the rice wine. Add the hoisin, oyster and soy sauces and toss well. Scatter with the remaining spring onions and serve."
        ]
    },
    {
        "title": "Spiced pecan marzipan",
        "rating": 5.0,
        "review_nums": 1,
        "ingredients": [
            "200g/7oz finely ground pecans, or half walnuts and half pecans",
            "100g/3½oz icing sugar",
            "125g4½oz soft brown sugar",
            "3 free-range egg yolks",
            "2 tsp liquid glucose",
            "1 tbsp honey",
            "1 tsp glycerine",
            "1-2 tsp ground cinnamon",
            "2 tsp vanilla extract"
        ],
        "method": [
            "Combine the ground pecans and icing sugar in a bowl and mix together. ",
            "In a saucepan, whisk together the brown sugar, egg yolks, glucose, honey, glycerine, cinnamon and vanilla, then cook over a low heat whisking constantly until pale, light and piping hot.",
            "Pour this over the pecan mixture and stir well to make a smooth paste. Wrap well and leave until cold before using."
        ]
    },
    {
        "title": "Chocolate muffins",
        "rating": 4.5,
        "review_nums": 24,
        "ingredients": [
            "100g/3½oz dark chocolate, 55-65% cocoa solids",
            "50g/1¾oz unsalted butter",
            "225g/8oz plain flour",
            "40g/1½oz cocoa powder",
            "1½ tsp bicarbonate of soda",
            "pinch of salt ",
            "100g/3½oz soft light brown sugar",
            "125g/4½oz golden caster sugar",
            "2 free-range eggs",
            "200ml/7fl oz buttermilk",
            "50g/1¾oz sunflower oil",
            "1 tsp vanilla extract",
            "100g/3½oz chocolate chips (dark, milk or white chocolate)"
        ],
        "method": [
            "Preheat the oven to 190C/170C Fan/Gas 5 and line a 12-hole muffin tin with paper cases.",
            "Chop the dark chocolate into 1cm/½in pieces and tip 50g/1¾oz into a heatproof mixing bowl with the butter. Set aside the remaining chocolate. ",
            "Melt the chocolate and butter over a pan of barely simmering water, making sure the bottom of the bowl doesn't touch the water, and stir until smooth. Remove from the heat and cool slightly. ",
            "Sift the flour, cocoa, bicarbonate of soda and a pinch of salt into a large mixing bowl, add both of the sugars, mix to combine and make a well in the middle of the dry ingredients. ",
            "Lightly whisk together the eggs, buttermilk, sunflower oil and vanilla and pour into the mixing bowl. Add the melted chocolate and butter and beat until just combined. Fold in the remaining chopped chocolate and the chocolate chips.",
            "Divide the mixture between the muffin tin cases and bake for about 20 minutes, or until well risen and a wooden skewer inserted into the middle of the muffins comes out with a moist crumb attached.",
            "Leave to cool in the tin for 5 minutes, then transfer to a wire rack to cool completely."
        ]
    },
    {
        "title": "Leftover turkey and potato pie",
        "rating": 5.0,
        "review_nums": 12,
        "ingredients": [
            "1 tbsp olive oil",
            "1 onion, finely chopped",
            "1 garlic clove, chopped",
            "680g/1lb 8oz leftover turkey, diced",
            "6 tomatoes, seeds removed, diced",
            "150ml/¼ pint chicken stock",
            "1 tsp Worcestershire sauce",
            "225g/8oz diced leftover vegetables (carrots, parsnips and sprouts)",
            "115g/4oz frozen peas",
            "salt and freshly ground black pepper",
            "450g/1lb roast potatoes",
            "25g/1oz melted butter"
        ],
        "method": [
            "Heat the oil in a large pan and add the onion and chopped garlic. Cook until softened but not coloured.",
            "Add the chopped turkey meat and cook until lightly coloured. Add the diced tomatoes, pour in the stock and Worcestershire sauce and bring to the boil.",
            "Simmer until it starts to thicken, then add the diced vegetables and peas and return to the boil. Season with salt and freshly ground black pepper and pour into a large pie dish. Allow to cool.",
            "Preheat the oven to 200C/400F/Gas 6.",
            "Slice the roast potatoes and lay carefully on top of the turkey mixture. Brush with melted butter and bake until hot in the middle and the potatoes are coloured, about 30 minutes."
        ]
    }
]